applications/solvers/dbs_reactiveThermalFoam/runs/differentCokeCombustionODESolvers/reactiveThermalValidations_2ndRK/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


chemistry           on;
chemicalTimeCoeff   0.1;
initialChemicalTimeStep 1e-07;
maxChemicalTimeStep     1e-2;

// ************************************************************************* //
