applications/solvers/dbs_reactiveThermalFoam/runs/differentCokeCombustionODESolvers/reactiveThermalValidations_2ndRK/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1.5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
33600
(
(0.000141883 -1.50902e-07 0)
(0.000142653 -1.08738e-07 0)
(0.000142842 -5.66448e-08 0)
(0.000142897 -3.25943e-08 0)
(0.000142947 -1.91125e-08 0)
(0.000142981 -1.07601e-08 0)
(0.000143001 -5.92376e-09 0)
(0.000143012 -3.1032e-09 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
80
(
(0.000142279 0 0)
(0.000421469 0 0)
(0.0006935 0 0)
(0.000958373 0 0)
(0.00121609 0 0)
(0.00146664 0 0)
(0.00171004 0 0)
(0.00194627 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
